cfg/ChartsOfCalculationTypes/СреднийЗаработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<ChartOfCalculationTypes>
		<Properties>
			<Name>СреднийЗаработок</Name>
			<Comment>(Регл)</Comment>
			<BaseCalculationTypes>
				<xr:Item>ChartOfCalculationTypes.ОсновныеНачисленияОрганизаций</xr:Item>
			</BaseCalculationTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьКатегорияРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЗачетОтработанногоВремени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCalculationTypes>
</MetaDataObject>

cfg/InformationRegisters/НастройкаОбновленияВидовРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>НастройкаОбновленияВидовРасчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НеОбновлятьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеОбновлятьТабличныеЧасти</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПланВидовРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПланыВидовРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.УдержанияОрганизаций</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ВзносыВФонды</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.СреднийЗаработок</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/Enums/ПланыВидовРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ПланыВидовРасчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновныеНачисленияОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдержанияОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносыВФонды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СреднийЗаработок</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/ChartsOfCalculationTypes/СреднийЗаработок/Forms/ФормаСписка/Ext/Form/Module.bsl
Процедура ДействияФормыНастройкаОбновления(Кнопка)
	
	Форма = РегистрыСведений.НастройкаОбновленияВидовРасчета.ПолучитьФормуСписка();
	Форма.РегистрСведенийСписок.Отбор.ПланВидовРасчета.Использование = Истина;
	Форма.РегистрСведенийСписок.Отбор.ПланВидовРасчета.ВидСравнения = ВидСравнения.Равно;
	Форма.РегистрСведенийСписок.Отбор.ПланВидовРасчета.Значение = Перечисления.ПланыВидовРасчета.СреднийЗаработок;
	Форма.Открыть();
	
КонецПроцедуры
